cmsis-svd/cmsis-svd/data/Atmel/ATSAMV70J19B.svd
            <register>
               <name>SLPWK_DR0</name>
               <description>SleepWalking Disable Register 0</description>
               <addressOffset>0x0118</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>PID7</name>
                     <description>Peripheral 7 SleepWalking Disable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID8</name>
                     <description>Peripheral 8 SleepWalking Disable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID10</name>
                     <description>Peripheral 10 SleepWalking Disable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID11</name>
                     <description>Peripheral 11 SleepWalking Disable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID13</name>
                     <description>Peripheral 13 SleepWalking Disable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID14</name>
                     <description>Peripheral 14 SleepWalking Disable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID16</name>
                     <description>Peripheral 16 SleepWalking Disable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID19</name>
                     <description>Peripheral 19 SleepWalking Disable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID20</name>
                     <description>Peripheral 20 SleepWalking Disable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID22</name>
                     <description>Peripheral 22 SleepWalking Disable</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID23</name>
                     <description>Peripheral 23 SleepWalking Disable</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID24</name>
                     <description>Peripheral 24 SleepWalking Disable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID25</name>
                     <description>Peripheral 25 SleepWalking Disable</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID26</name>
                     <description>Peripheral 26 SleepWalking Disable</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID27</name>
                     <description>Peripheral 27 SleepWalking Disable</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID28</name>
                     <description>Peripheral 28 SleepWalking Disable</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID29</name>
                     <description>Peripheral 29 SleepWalking Disable</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID30</name>
                     <description>Peripheral 30 SleepWalking Disable</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID31</name>
                     <description>Peripheral 31 SleepWalking Disable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SLPWK_SR0</name>
               <description>SleepWalking Status Register 0</description>
               <addressOffset>0x011C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>PID7</name>
                     <description>Peripheral 7 SleepWalking Status</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID8</name>
                     <description>Peripheral 8 SleepWalking Status</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID10</name>
                     <description>Peripheral 10 SleepWalking Status</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID11</name>
                     <description>Peripheral 11 SleepWalking Status</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID13</name>
                     <description>Peripheral 13 SleepWalking Status</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID14</name>
                     <description>Peripheral 14 SleepWalking Status</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID16</name>
                     <description>Peripheral 16 SleepWalking Status</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID19</name>
                     <description>Peripheral 19 SleepWalking Status</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID20</name>
                     <description>Peripheral 20 SleepWalking Status</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID22</name>
                     <description>Peripheral 22 SleepWalking Status</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID23</name>
                     <description>Peripheral 23 SleepWalking Status</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID24</name>
                     <description>Peripheral 24 SleepWalking Status</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID25</name>
                     <description>Peripheral 25 SleepWalking Status</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID26</name>
                     <description>Peripheral 26 SleepWalking Status</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID27</name>
                     <description>Peripheral 27 SleepWalking Status</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID28</name>
                     <description>Peripheral 28 SleepWalking Status</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID29</name>
                     <description>Peripheral 29 SleepWalking Status</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID30</name>
                     <description>Peripheral 30 SleepWalking Status</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID31</name>
                     <description>Peripheral 31 SleepWalking Status</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SLPWK_ASR0</name>
               <description>SleepWalking Activity Status Register 0</description>
               <addressOffset>0x0120</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>PID7</name>
                     <description>Peripheral 7 Activity Status</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID8</name>
                     <description>Peripheral 8 Activity Status</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID10</name>
                     <description>Peripheral 10 Activity Status</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID11</name>
                     <description>Peripheral 11 Activity Status</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID13</name>
                     <description>Peripheral 13 Activity Status</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID14</name>
                     <description>Peripheral 14 Activity Status</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID16</name>
                     <description>Peripheral 16 Activity Status</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID19</name>
                     <description>Peripheral 19 Activity Status</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID20</name>
                     <description>Peripheral 20 Activity Status</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID22</name>
                     <description>Peripheral 22 Activity Status</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID23</name>
                     <description>Peripheral 23 Activity Status</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID24</name>
                     <description>Peripheral 24 Activity Status</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID25</name>
                     <description>Peripheral 25 Activity Status</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID26</name>
                     <description>Peripheral 26 Activity Status</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID27</name>
                     <description>Peripheral 27 Activity Status</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID28</name>
                     <description>Peripheral 28 Activity Status</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID29</name>
                     <description>Peripheral 29 Activity Status</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID30</name>
                     <description>Peripheral 30 Activity Status</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID31</name>
                     <description>Peripheral 31 Activity Status</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PMMR</name>
               <description>PLL Maximum Multiplier Value Register</description>
               <addressOffset>0x0130</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PLLA_MMAX</name>
                     <description>PLLA Maximum Allowed Multiplier Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SLPWK_ER1</name>
               <description>SleepWalking Enable Register 1</description>
               <addressOffset>0x0134</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>PID32</name>
                     <description>Peripheral 32 SleepWalking Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID33</name>
                     <description>Peripheral 33 SleepWalking Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID34</name>
                     <description>Peripheral 34 SleepWalking Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID35</name>
                     <description>Peripheral 35 SleepWalking Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID40</name>
                     <description>Peripheral 40 SleepWalking Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID43</name>
                     <description>Peripheral 43 SleepWalking Enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID44</name>
                     <description>Peripheral 44 SleepWalking Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID45</name>
                     <description>Peripheral 45 SleepWalking Enable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID46</name>
                     <description>Peripheral 46 SleepWalking Enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID47</name>
                     <description>Peripheral 47 SleepWalking Enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID48</name>
                     <description>Peripheral 48 SleepWalking Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID49</name>
                     <description>Peripheral 49 SleepWalking Enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID50</name>
                     <description>Peripheral 50 SleepWalking Enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID51</name>
                     <description>Peripheral 51 SleepWalking Enable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID52</name>
                     <description>Peripheral 52 SleepWalking Enable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID53</name>
                     <description>Peripheral 53 SleepWalking Enable</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID56</name>
                     <description>Peripheral 56 SleepWalking Enable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID57</name>
                     <description>Peripheral 57 SleepWalking Enable</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID58</name>
                     <description>Peripheral 58 SleepWalking Enable</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID59</name>
                     <description>Peripheral 59 SleepWalking Enable</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID60</name>
                     <description>Peripheral 60 SleepWalking Enable</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
